In [108]:
import numpy as np
import pandas as pd

# Part no 1

In [3]:
#lambda means creating a function in one line without gives function any name
frame_data = pd.DataFrame(np.random.randn(4, 3),
                         columns = list('ABC'),
                         index = ['Karachi', 'Lahore', 'Peshawar', 'Islamabad'])
frame_data

                  A         B         C
Karachi    0.277518  1.416451  0.654912
Lahore    -0.097352  0.236402 -0.007868
Peshawar   0.535842  0.473335  0.114958
Islamabad  0.053807  1.352232 -0.085947

In [4]:
np.abs(frame_data)  #make all values positive

                  A         B         C
Karachi    0.277518  1.416451  0.654912
Lahore     0.097352  0.236402  0.007868
Peshawar   0.535842  0.473335  0.114958
Islamabad  0.053807  1.352232  0.085947

In [15]:
print("Minimum Value of A:")
print("\t", frame_data['A'].min())   #show the value negative because the actual value is negative
print("Maximum Value of A:")
print("\t", frame_data['A'].max())
print("Mean Value of A:")
print("\t", frame_data['A'].max() - frame_data['A'].min())

Minimum Value of A:
	 -0.09735152484663048
Maximum Value of A:
	 0.5358418735093451
Mean Value of A:
	 0.6331933983559755

In [26]:
# creating a new series using lambda
mean = lambda w: w.max() - w.min() #generating new values by taking mean from the frame_data
#this function apply on each column
df = frame_data.apply(mean)
print(df, type(df))

A    0.633193
B    1.180049
C    0.740859
dtype: float64 <class 'pandas.core.series.Series'>

In [27]:
df = frame_data.apply(mean, axis=1)
#'1' means that the whole function apply on each row in your dataframe
print(df)

Karachi      1.138933
Lahore       0.333754
Peshawar     0.420884
Islamabad    1.438179
dtype: float64

# Part no 2

In [52]:
def max_min(x):
    return pd.Series([x.max(), x.min()], index = ["Max", "Mini"])

In [53]:
df_two = frame_data.apply(max_min)
print(df_two)

             A         B         C
Max   0.535842  1.416451  0.654912
Mini -0.097352  0.236402 -0.085947

In [82]:
#sorting and ranking
number_frame = pd.DataFrame(np.arange(8).reshape(2, 4),
                        index = ['Two', 'One'],
                        columns = ['D', 'A', 'B', 'C'])

number_frame

     D  A  B  C
Two  0  1  2  3
One  4  5  6  7

In [83]:
number_frame_descending = number_frame.sort_index(axis = 1, ascending=False)
number_frame_descending

     D  C  B  A
Two  0  3  2  1
One  4  7  6  5

In [84]:
number_frame_ascending = number_frame.sort_index()
number_frame_ascending

     D  A  B  C
One  4  5  6  7
Two  0  1  2  3

In [91]:
#Sort by values
print(number_frame.sort_values(by='B'))

     D  A  B  C
Two  0  1  2  3
One  4  5  6  7

In [92]:
#ranking the series
print(number_frame.rank(ascending=False, method='max'))
print()
print(number_frame.rank(ascending=True, method='min'))
print()
print(number_frame.rank(axis='columns'))

       D    A    B    C
Two  2.0  2.0  2.0  2.0
One  1.0  1.0  1.0  1.0

       D    A    B    C
Two  1.0  1.0  1.0  1.0
One  2.0  2.0  2.0  2.0

       D    A    B    C
Two  1.0  2.0  3.0  4.0
One  1.0  2.0  3.0  4.0

In [98]:
#Summurize and computing Descriptive statistics
data = pd.DataFrame([
    [3, np.nan], [np.nan, 7], [6, np.nan], [4.5, 6.7]
        ],
                    index = ['A', 'B', 'C', 'D'],
                   columns = ['one', 'two']
                   )

data

   one  two
A  3.0  NaN
B  NaN  7.0
C  6.0  NaN
D  4.5  6.7

In [102]:
print(data.sum())  #sum of all columns

one    13.5
two    13.7
dtype: float64

In [103]:
print(data.sum(axis='columns'))   #sum every row in your dataframe

A     3.0
B     7.0
C     6.0
D    11.2
dtype: float64

In [104]:
#skipna=False means that NaN value is also involve/include in mean operation
print(data.mean(axis='columns', skipna=False))

A    NaN
B    NaN
C    NaN
D    5.6
dtype: float64

In [116]:
#unique() don't show you repeated values in your dataframe

data_two = pd.DataFrame([
    [3, np.nan, 6.50, 3], [np.nan, 7, 1.1, 7], [6, np.nan, 4, np.nan], [4.5, 6.7, np.nan, 3]
        ],
                    index = ['A', 'B', 'C', 'D'],
                   columns = ['one', 'two', 'three', 'four']
                   )

data_two

   one  two  three  four
A  3.0  NaN    6.5   3.0
B  NaN  7.0    1.1   7.0
C  6.0  NaN    4.0   NaN
D  4.5  6.7    NaN   3.0

In [119]:
print(data_two['one'].unique())
print(data_two['two'].unique())
# .value_counts() count the total same value in any column
print("Column One Data Show Below:")
print(data_two['one'].value_counts())
print("Column Four Data Show Below:")
print(data_two['four'].value_counts())

[3.  nan 6.  4.5]
[nan 7.  6.7]
Column One Data Show Below:
4.5    1
6.0    1
3.0    1
Name: one, dtype: int64
Column Four Data Show Below:
3.0    2
7.0    1
Name: four, dtype: int64